[Common]
FolderName=Wiz.Format.Converter
AppName=Document Format Converter
AppName_2052=文档格式转化器
AppName_1028=文档格式转化器
AppGUID={047AE176-F6DC-47B2-8588-69655AB4AF58}
AppType=Edit
AppVersion=1.0
SupportVersion=2
PluginCount=4

[Plugin_0]
Caption=文档格式转化器
GUID={CE87750B-E399-4B88-9DCA-A6A04F8C8633}
ScriptFileName=dc_global.js
Type=Global

[Plugin_1]
MenuType=NoteShare
Caption=Save Current Doc to Markdown file
Caption_2052=另存当前文档为 Markdown
Caption_1028=另存当前文档为 Markdown
GUID={c8c5a10c-8a51-4a21-b4f3-6aa4f2e753f1}
Type=ExecuteScript
ScriptFileName=dist/SaveCurDocToMarkdown.js

[Plugin_2]
MenuType=DocumentCtrl
Caption=Save Selected Docs to Markdown file
Caption_2052=另存选中文档为 Markdown
Caption_1028=另存选中文档为 Markdown
GUID={f3b0cf5a-25ab-4bce-8e1a-891866b952db}
ScriptFileName=dist/SaveSelectedDocToMarkdown.js
Type=ExecuteScript

[Plugin_3]
MenuType=CategoryCtrlFolders
Caption=Save Docs in Selected Folder to Markdown file
Caption_2052=另存该文件夹里所有文档为 Markdown
Caption_1028=另存该文件夹里所有文档为 Markdown
GUID={a82fb8b4-dbe5-4519-83cd-61a027f6f7b7}
ScriptFileName=dist/SaveFolderDocToMarkdown.js
Type=ExecuteScript